# Top > first > second のurl を返す

def yodobashi(first, second)
	$base_url = "http://www.yodobashi.com/"
	$category = Hash.new()
	$category["パソコン"] = {
		"パソコン周辺機器" => "パソコン周辺機器/ct/19532_500000000000000201/",
		"パソコン" => "パソコン/ct/11970_500000000000000201/",
		"パソコンアクセサリー" => "パソコンアクセサリー/ct/19533_500000000000000201/",
		"パソコンソフト" => "パソコンソフト/ct/19535_500000000000000201/",
		"プリンター" => "プリンター/ct/38009_500000000000000201/",
		"パソコンサプライ・消耗品" => "パソコンサプライ・消耗品/ct/19534_500000000000000201/",
		"プリンター用紙" => "プリンター用紙/ct/46011_500000000000000201/",
		"Mac" => "Mac/ct/47027_500000000000000201/"
	}
	$category["家電"] = {
		"リビング・衣類" => "リビング-衣類家電/ct/6354_500000000000000211/",
		"キッチン" => "キッチン家電/ct/6355_500000000000000211/",
		"調理" => "調理機器・調理家電/ct/6356_500000000000000211/",
		"季節・空調" => "季節・空調家電/ct/6357_500000000000000211/",
		"理美容家電" => "理美容家電/ct/6358_500000000000000211/",
		"照明器具" => "照明器具/ct/34039_500000000000000211/",
		"電話機・ファックス" => "電話機-ファックス/ct/6359_500000000000000211/",
		"健康家電" => "健康家電/ct/6362_500000000000000211/",
		"エアコン" => "/エアコン/ct/38073_500000000000000211/",
		"LED電球" => "LED電球/ct/33002_500000000000000211/",
		"ガーデニング用品" => "ガーデニング用品/ct/72125_500000000000000211/",
		"電球・蛍光灯" => "電球・蛍光灯/ct/34072_500000000000000211/"
	}
	$category["AV機器"] = {
		"オーディオ" => "オーディオ機器/ct/22054_500000000000000212/",
		"テレビ" => "テレビ・関連用品/ct/35450_500000000000000212/",
		"ブルーレイ・DVDレコーダー" => "ブルーレイ-DVDレコーダー・関連用品/ct/35449_500000000000000212/",
		"オーディオアクセサリー" => "オーディオアクセサリー/ct/22056_500000000000000212/",
		"AVコンポーネント" => "AVコンポーネント/ct/43012_500000000000000212/",
		"電子ピアノ・楽器・DTM" => "電子ピアノ-楽器-DTM/ct/34341_500000000000000212/",
		"iPod" => "iPod/ct/48011_500000000000000212/",
		"ビジュアルアクセサリー" => "ビジュアルアクセサリー/ct/36060_500000000000000212/"
	}
	# アウトドア・スポーツ用品の自転車アクセサリはさらに深いので後回し
	$category["アウトドア・スポーツ用品"] = {
		"自転車本体" => "自転車本体/ct/152024_000000000000008010/",
		"自転車アクセサリ" => {


		}
	}
	$category["カメラ"] = {
		"デジタルカメラ" => {
			"コンパクトデジタルカメラ" => "ec/feature/53149_500000000000000301/",
			"デジタル一眼レフ" => "ec/feature/53151_500000000000000301/",
			"ミューレス一眼カメラ" => "ec/feature/200003_500000000000000301/",
			"トイカメラ" => "トイカメラ（デジタル）/ct/85001_500000000000000301/",
			"中判デジタルカメラ" => "中判デジタルカメラ本体/ct/53152_500000000000000301/",
			"レンジファインダーデジタルカメラ" => "デジタルレンジファインダーカメラ本体/ct/53155_500000000000000301/"
		},
		"ビデオカメラ" => {

		},
		"交換レンズ" => {

		},
		"カメラアクセサリ" => "カメラアクセサリ/ct/50135_500000000000000301/",
		"フィルム" => "カメラ用フィルム/ct/34561_500000000000000301/"
	}
	$category["ベビー・おもちゃ・ホビー"] = {

	}
	return $base_url + URI.escape($category[first][second])
end

def biccamera(first, second)

end







